Repository: Ghoughpteighbteau/nasc
Catalog: po/extra/*.po
Languages: pt

source: Do maths like a normal person
pt: Faça cálculos como uma pessoa normal

source: Calculator
pt: Calculadora

source: calculation;arithmetic;scientific;financial;
pt: calculation;cálculos;arithmetic;aritmética;scientific;científico;financial;financeiro;

source: It’s an app where you do maths like a normal person. It lets you type whatever you want and smartly figures out what is math and spits out an answer on the right pane. Then you can plug those answers in to future equations and if that answer changes, so does the equations it’s used in.
pt: É uma aplicação onde faz os seus cálculos como uma pessoa normal. Permite escrever o que quiser e descobre, de forma inteligente, qual é o resultado do cálculo e exibe uma resposta no painel direito. Depois, pode inserir essa resposta dentro de equações futuras e se a resposta mudar, também a equação que foi usada muda.

source: Build libqalculate as submodule - This means better calculation results and more functions
pt: O libqalculate foi construido como um submódulo - Isto significa resultados de cálculos mais precisos e mais funções

source: Added convert to different number bases. E.g. 16734003 to hex
pt: Conversão adicionada a bases de números diferentes Ex. 16734003 para hexadecimal

source: Available number bases: hex bin dec oct duo roman bijective roman sexa fp32 fp64 fp16 fp80 fp128
pt: Bases de números disponíveis: hex bin dec oct duo roman bijective roman sexa fp32 fp64 fp16 fp80 fp128

source: Improved scroll behavior when using long equations or results
pt: Comportamento de deslizar melhorado ao usar equações ou resultados longos

source: Ctrl + Shift + C copys result when nothing is marked in the input pane
pt: Ctrl + Shift + C copia o resultado quando nada está marcado no painel de entrada

source: Right click on a result copies it to the clipboard
pt: Clicar no botão direito do rato num resultado vai copiá-lo para a área de transferência

source: Auto complete functions with parenthesis
pt: Completar funções automaticamente com o parênteses

source: Quit on Ctrl + Q
pt: Sair ao usar Ctrl + Q

source: Fix of a parsing error in the help pane
pt: Correção de um erro de análise no painel de ajuda

source: Update desktop file.
pt: Atualização do ficheiro do ambiente de trabalho.

source: Fix double NaSC icon.
pt: Correção do ícone duplo do NaSC.

source: Fix linking of qalculatenasc lib.
pt: Correção de ligação da qalculatenasc lib.

source: Update Debian control file.
pt: Atualização do ficheiro de controlo Debian.

source: Release for Juno.
pt: Lançamento para o Juno.

source: Main view
pt: Vista principal

source: Help pane
pt: Painel de ajuda

source: Periodic table
pt: Tabela periódica
