Repository: Ghoughpteighbteau/nasc
Catalog: po/*.po
Languages: pt

source: Open help
pt: Abrir ajuda

source: Export…
pt: Exportar…

source: Export to PDF
pt: Exportar para PDF

source: Share via PasteBin
pt: Partilhar via PasteBin

source: Name
pt: Nome

source: Copy & Paste
pt: Copiar & Colar

source: To support the referenced results there are 2 kind of copy in NaSC.
pt: Para suportar os resultados referenciados existem 2 tipos de cópia no NaSC.

source: The normal copy via context menu or <i>Ctrl + c</i> will replace the referenced results with their real values.
pt: A cópia normal via menu de contexto ou <i>Ctrl + c</i> vai substituir os resultados referenciados com os seus valores reais.

source: Copy via <i>Ctrl + Shift + C</i> will replace the referenced results with lineX references.
pt: Copiar via <i>Ctrl + Shift + C</i> vai substituir os resultados referenciados com referências lineX.

source: Paste will connect lineX references with the corresponding results.
pt: Colar vai conectar referências lineX com os resultados correspondentes.

source: Referencing answers
pt: Referenciar respostas

source: You can plug answers in to future equations and if that answer changes, so does the equations its used in.
pt: Pode inserir respostas dentro de equações futuras e se a resposta mudar, também a equação que foi usada muda.

source: You either can just click on a previous answer in the result pane, use the keyword <i>ans</i> for the last answer or the keyword <i>lineX</i> where X is the number of the line which you want to use.
pt: Também pode clicar numa resposta anterior no painel de resultados, usando a palavra chave <i>ans</i> para a última resposta ou usar a palavra chave <i>lineX</i> em que X é o número da linha que pretende usar.

source: Shortcuts
pt: Atalhos

source: Help
pt: Ajuda

source: Last Answer
pt: Última Resposta

source: New Sheet
pt: Folha Nova

source: Periodic Table
pt: Tabela Periódica

source: Show a Periodic Table. You can browse through the elements and insert properties into your calculation. Just click on the properties like for example the boiling point.
pt: Mostra a Tabela Periódica. Pode navegar pelos elementos e inserir propriedades na seu cálculo. Basta clicar nas propriedades como por exemplo o ponto de ebulição.

source: Scrubbing
pt: Esfregar

source: If you hover over a number you can manipulate this number while pressing the left mouse button and move the mouse to the left or to the right.
pt: Se passar com o rato por cima de um número pode manipulá-lo enquanto pressiona o botão esquerdo do rato e mover o mesmo para a esquerda ou para a direita.

source: Show the NaSC Tutorial again.
pt: Mostrar o Tutorial NaSC novamente.

source: Unit Conversion
pt: Conversão de Unidades

source: You can convert various Units. The keyword is <i>to</i>.
pt: Pode converter várias unidades. A palavra chave é <i>to</i>.

source: For example: 100€ to $ 23cm to in
pt: Por exemplo: 100€ to $ 23cm to in

source: Advanced Math
pt: Matemática Avançada

source: Create new sheet
pt: Criar uma folha nova

source: Remove sheet
pt: Remover folha

source: Undo last sheet removal
pt: Desfazer a remoção da última folha

source: Share files with pastebin service
pt: Partilhe ficheiros com o serviço pastebin

source: Name:
pt: Nome:

source: Expiry time:
pt: Tempo de expiração:

source: Keep this paste private
pt: Manter esta pasta privada

source: Upload
pt: Enviar

source: Never
pt: Nunca

source: Ten minutes
pt: Dez minutos

source: One hour
pt: Uma hora

source: One day
pt: Um dia

source: One month
pt: Um mês

source: Weight:
pt: Peso:

source: Boiling Point:
pt: Ponto de Ebulição:

source: Melting Point:
pt: Ponto de Fusão:

source: Density:
pt: Densidade:

source: Classification:
pt: Classificação:

source: Alkali Metal
pt: Metal Alcalino

source: Alkaline-Earth Metal
pt: Metal Alcalino-Terroso

source: Lanthanide
pt: Lantanídeo

source: Actinide
pt: Actinídeo

source: Transition Metal
pt: Metal de Transição

source: Metalloid
pt: Semimetal

source: Non-Metal
pt: Não Metal

source: Halogen
pt: Halogénio

source: Noble Gas
pt: Gás Nobre

source: Transactinide
pt: Transactinídeo

source: Unknown
pt: Desconhecido

source: Hello %s!
pt: Olá %s!

source: In NaSC you can put text and math side by side and the answer will be shown on the right pane.
pt: No NaSC pode colocar texto e matemática lado a lado e a resposta vai ser exibida no painel direito.

source: Do you want to learn the basics?
pt: Quer aprender o básico?

source: Let's start with simple math.
pt: Vamos começar com um cálculo simples.

source: Calculate: 11 + 42
pt: Calcule: 11 + 42

source: You can plug the answers (ans) in future equations. Just click on the answer.
pt: Pode inserir respostas (ans) dentro de equações futuras. Basta clicar na resposta.

source: If an answer changes, so does the equation it's used in.
pt: Se a resposta mudar, também a equação que foi usada muda.

source: Calculate: <i>ans</i> * 2
pt: Calcule: <i>ans</i> * 2

source: You can also reference the last answer with the keyword "ans" or with "lineX" where X is the linenumber of the answer.
pt: Também pode referenciar a última resposta usando a palavra chave "ans" ou com "lineX em que o X é o número da linha da resposta.

source: Calculate: sin 45° + cos 2rad (Hint: get degrees with ctrl+0)
pt: Calcule: sin 45° + cos 2rad (Dica: obtenha os graus com ctrl+0)

source: You can define your own variables
pt: Pode definir as suas próprias variáveis

source: Calculate: a = 5
pt: Calcule: a = 5

source: and use them in your equations
pt: e use-as nas suas equações

source: Calculate: 22 + a
pt: Calcule: 22 + a

source: You can get answers in various units
pt: Pode obter respostas em várias unidades

source: Calculate: 14 cm * 3 cm
pt: Calcule: 14 cm * 3 cm

source: and convert between these units
pt: e converta entre estas unidades

source: Calculate: <i>ans</i> to in
pt: Calcule: <i>ans</i> to in

source: You can play with time
pt: Pode jogar com o tempo

source: Calculate: 3days + 4hour + 4years to ms
pt: Calcule: 3dias + 4horas + 4anos to ms

source: or print the week of the year
pt: ou imprima a semana do ano

source: Calculate: week(12.12.2017)
pt: Calcule: semana(12.12.2017)

source: For a list of all those keywords and their capabilities, just open the help.
pt: Para uma lista de todas as palavras chave e as suas capacidades, basta abrir a ajuda.

source: Calculate: The absolute value of -2 (Hint: abs)
pt: Calcule: O valor absoluto de -2 (Dica: abs)

source: Shortcuts:
pt: Atalhos:

source: Calculate: π * 42cm
pt: Calcule: π * 42cm

source: Great, you finished the Tutorial.
pt: Ótimo, terminou o Tutorial.

source: Have fun with NaSC
pt: Divirta-se com o NaSC
